// 祈愿系统配置
export const wishConfig = {
  // 普通祈愿（总概率 5 * 19=95%）
  common: [
    {
      name: '蚱蜢优购',
      effect: '下一次购买武器(非传奇)享有20%的折扣',
    },
    {
      name: '灵狐升运',
      effect: '下一次升级武器享有20%的折扣',
    },
    {
      name: '王权增幅',
      effect: '攻击伤害提高5%',
    },
    {
      name: '金柚赐福',
      effect: '立即获得3张资源兑换券',
    },
    {
      name: '夜市赠礼',
      effect: '立即获得3枚咕咕币',
    }
  ],

  // 稀有祈愿（总概率 5 * 1=5%）
  rare: [
    {
      name: '悲鸣之锋',
      effect: '攻击伤害提高10%，武器每等级提高5%伤害',
    },
    {
      name: '精灵双倍',
      effect: '下一次击败主宰时可获得双倍资源兑换券',
    },
    {
      name: '喵喵财源',
      effect: '签到获得双倍的金币和咕咕币',
    },
    {
      name: '暴击韵律',
      effect: '攻击暴击率提高20%',
    },
    {
      name: '酥手空空',
      effect: '立即失去50枚金币',
    }
  ]
} as const;